In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data = pd.read_csv("https://raw.githubusercontent.com/DependerKumarSoni/Position-Salaries-Kaggle/main/Position_Salaries.csv")

In [ ]:
data.head()

            Position  Level  Salary
0   Business Analyst      1   45000
1  Junior Consultant      2   50000
2  Senior Consultant      3   60000
3            Manager      4   80000
4    Country Manager      5  110000

In [ ]:
data.tail()

         Position  Level   Salary
5  Region Manager      6   150000
6         Partner      7   200000
7  Senior Partner      8   300000
8         C-level      9   500000
9             CEO     10  1000000

In [ ]:
X = data[['Level']]
Y = data['Salary']

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
x_train, x_test, y_train, y_test = train_test_split(X, Y, test_size=0.1, random_state=12)

In [ ]:
from sklearn.svm import SVR

In [ ]:
reg = SVR()

In [ ]:
reg.fit(x_train, y_train)

SVR()

In [ ]:
y_pred = reg.predict(x_test)

In [ ]:
print(y_test, y_pred)

   Salary
5  150000 [110001.66304176]